TSD_TK/src/DataProcessors/ПанельМеню/ПанельМеню.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ПанельМеню</name>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Артикул</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>6</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ШтрихКод</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>13</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НаименованиеТовара</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НаименованиеТовара2</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НаименованиеЕдиницы</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>15</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Коэффициент</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоПоставщика</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоПодтверждено</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоВведено</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Остаток</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерСтрокиДокумента</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Продажи</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоРасхождение</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПричинаРасхождения</name>
      <type>
        <types>EnumRef.ПричиныРасхождения</types>
      </type>
    </attributes>
    <attributes>
      <name>ПричинаРасхожденияСтрока</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>30</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>15</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КодХарактеристики</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>8</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Весовой</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>1</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>МРЦ</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИспМРЦ</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ПричинаРасхожденияПорядок</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>1</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СканированиеТовар</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СканированиеЦенник</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаПроверена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СпецЦена</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>15</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>УсловиеВозврата</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаЦенник</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АМ</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>1</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДокументИД</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Получатель</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПриемДо</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Артикул2</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>6</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Документы</name>
    <attributes>
      <name>ТипДокумента</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Дата</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерДокумента</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДокументUUID</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Контрагент</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>55</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КонтрагентUUID</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СкладUUID</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Инфо</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Проведен</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>1</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Регл</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>1</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Акт</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>1</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоПринято</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоПоставщика</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИД</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДокументЗакрыт</name>
      <comment>0 - новый 1 - закрыт частично 2 - закрыт полностью</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>1</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаИсполнения</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗаданиеПроцесса</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>1</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

TSD_TK/src/DataProcessors/ПанельМеню/Forms/Документ/Module.bsl
&НаКлиенте
Перем ВыполняетсяЗакрытие;


&НаСервере
Процедура ЗаполнитьДокумент(Отказ)
	
	ВидДокумента = Параметры.ВидДокумента;
	ДокументUUID = Параметры.ДокументUUID;
	ДатаДокумента = ТекущаяДата();
	Если ВидДокумента = "PRIX" Тогда
		НомерДокумента = Параметры.НомерДокумента;
	КонецЕсли;
	
	ДанныеДокумента = ИнтеграцияТК_ВызовСервера.ПолучитьДанныеДокумента(Параметры);
	 
	Если ДанныеДокумента.Результат Тогда
		
		Документ       = ДанныеДокумента.Ответ;
		Склад          = Документ.Sklad;
		СкладUUID      = Документ.SkladUUID;
		Контрагент     = Параметры.Контрагент;
		КонтрагентUUID = Параметры.КонтрагентUUID;
		
		Для Каждого СтрТовары Из Документ.Tovary Цикл 
			нСтрокаТовары = Объект.Товары.Добавить();
			нСтрокаТовары.Артикул 			  = СтрТовары.Art;
			нСтрокаТовары.НаименованиеТовара  = СтрТовары.Tovar;
			нСтрокаТовары.НаименованиеЕдиницы = СтрТовары.EdIzm;
			нСтрокаТовары.Коэффициент		  = СтрТовары.Kof;
			нСтрокаТовары.Количество 		  = 0;
			нСтрокаТовары.Остаток 			  = СтрТовары.Kol;
			ОбновитьЗаписьПоСтроке(нСтрокаТовары);
		КонецЦикла;
		
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "ГруппаКонтрагент", "Доступность",Ложь);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "СкладСписания", "Доступность",Ложь);
	Элементы.СтраницыПролистывания.ТекущаяСтраница = Элементы.СтраницаТовары;

	Иначе
		Отказ = Истина;
		Сообщить("Ошибка получение данных с сервера" + Символы.ПС+ДанныеДокумента.ОписаниеОшибки);
	КонецЕсли;
	
	
КонецПроцедуры



&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	 		
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	Объект.Товары.Очистить();

	НастроитьФормуПоЗначениямНастроек();
	Если ВидДокумента = "ПриемТовара" Тогда
		ДатаДокумента = ТекущаяДата();
		НомерДокумента = "б/н";
		Контрагенты = Справочники.Контрагенты.АдмиралХФК;
	ИначеЕсли ВидДокумента ="IN" Тогда
		СтрСклад =   ИнтеграцияТК_ВызовСервера.ПолучитьДанныеСкладовПодразделения();
		Если СтрСклад.Результат И СтрСклад.Ответ.Количество()<>0 Тогда
			СтрокаСклад = СтрСклад.Ответ[0];
			СкладUUID = СтрокаСклад.Значение;
			Склад = СтрокаСклад.Представление;
		КонецЕсли;
		
	КонецЕсли;
	
	
	НастроитьФормуПоОриентацииЭкрана();
	Если Параметры.Свойство("ОбновитьДанные") Тогда
		ДоументСервер = Истина;
		ЗаполнитьДокумент(Отказ);
	КонецЕсли;
	
	

	
КонецПроцедуры

&НаСервере
Процедура НастроитьФормуПоЗначениямНастроек()
	
	ВводкКоличества = Истина;
		
//	ТипДокумента = Параметры.ТипДокумента;
	ЗаполнитьЗначенияСвойств(ЭтаФорма, Параметры,"ТипДокумента,ВидДокумента"); 
	Заголовок    = ТипДокумента;
	ИспользуетсяАсинхронныйСканер = ЗначениеНастроекВызовСервераПовтИсп.ИспользуетсяАсинхронныйСканерШтрихкодов();
	Инициализирован = НЕ ПустаяСтрока(ПараметрыСеанса.Подразделение);
	
	ОбщегоНазначения.УстановитьШрифт(ЭтаФорма);
	
	ОбщегоНазначения.УстановитьВысотуПоляНаименованиеТовара(ЭтаФорма,"ТоварыНаименованиеТовара");
	
	ОбновитьПодразделение();
	
	ЕстьОборудованиеСканирования = ЗначениеЗаполнено(ЗначениеНастроекВызовСервераПовтИсп.ТипУстройстваСканирования());

	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "Сканировать", "Видимость",
		(ЕстьОборудованиеСканирования И НЕ ИспользуетсяАсинхронныйСканер) И Инициализирован
	);

	
	ВидимостьКонтрагент = Истина;
	ВидимостьКонтрагенты = Ложь;
	Если ВидДокумента = "Списание" Или ВидДокумента = "PRN" ИЛИ ВидДокумента = "ПриемТовара" Тогда
		ВидимостьКонтрагент = Ложь;
	КонецЕсли;
	
	Если  ВидДокумента = "ПриемТовара" Тогда
		ВидимостьКонтрагенты = Истина;
	КонецЕсли;

	
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "Контрагенты", "Видимость",
		ВидимостьКонтрагенты

	);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "ГруппаКонтрагент", "Видимость",
		ВидимостьКонтрагент

	);
	

	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "ГруппаСписание", "Видимость",
		ВидДокумента = "Списание" 
	);


	ВидимостьНомерДата = Ложь;
	Если  ВидДокумента = "ПриемТовара" ИЛИ ВидДокумента ="PRIX"  ИЛИ ВидДокумента = "ZAK" Тогда
		ВидимостьНомерДата = Истина;
	КонецЕсли;
		
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "ГруппаНомеДатаДокумента", "Видимость",
		ВидимостьНомерДата
	);
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "ГруппаТипПеремещения", "Видимость",
		ВидДокумента = "PRN"
	);
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "ФормаРасхождения", "Видимость",
	ВидДокумента ="PRIX"  ИЛИ ВидДокумента = "ZAK"
	);

	НастроитьЭлементыАсинхронногоСканера();
	

	
КонецПроцедуры

&НаСервере
Процедура ОбновитьПодразделение()
	
	Если ПустаяСтрока(ПараметрыСеанса.Подразделение) Тогда
		Элементы.СообщениеИнициализации.Заголовок = "Устройство не инициализировано";
		ОбщегоНазначения.УстановитьЦветПолейОшибок(ЭтаФорма, "СообщениеИнициализации");
		Склад = "";
		Инициализирован = Ложь;
		
	Иначе
		Если ПараметрыСеанса.Подразделение <> Элементы.СообщениеИнициализации.Заголовок Тогда
			Склад = "";
			СкладUUID = "";
		КонецЕсли;
		

		Элементы.СообщениеИнициализации.Заголовок = ПараметрыСеанса.Подразделение;
		ОбщегоНазначения.УстановитьЦветИнформационныхНадписей(ЭтаФорма, "СообщениеИнициализации");
		Инициализирован = Истина;
		
		
		
	КонецЕсли;
	
	ЕстьОборудованиеСканирования = ЗначениеЗаполнено(ЗначениеНастроекВызовСервераПовтИсп.ТипУстройстваСканирования());
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "Сканировать", "Доступность",
	(ЕстьОборудованиеСканирования И НЕ ИспользуетсяАсинхронныйСканер) И Инициализирован
	);

	
КонецПроцедуры


&НаСервере
Процедура НастроитьЭлементыАсинхронногоСканера()
	
	//АсинхронныйСканерИнициализирован = ПодключаемоеОборудованиеВызовСервера.СканерШтрихкодовИнициализирован();
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "АктивироватьСканер", "Видимость", 
		ИспользуетсяАсинхронныйСканер
	);
	
КонецПроцедуры


&НаСервере
Процедура НастроитьФормуПоОриентацииЭкрана()
	ГоризонтальнаяОриентацияЭкрана = ПараметрыСеанса.ГоризонтальнаяОриентацияЭкрана;
	
	Если ПараметрыСеанса.ГоризонтальнаяОриентацияЭкрана Тогда
	//	Элементы.страницы.ТекущаяСтраница = Элементы.СтраницаГоризонтальная;
	Иначе
		Элементы.страницы.ТекущаяСтраница = Элементы.СтраницаВертикальная;
	КонецЕсли;
	

КонецПроцедуры

&НаСервере
Процедура ПриИзмененииПараметровЭкранаСервер()
	
	ОбщегоНазначения.УстановитьОриентациюЭкрана();
	НастроитьФормуПоОриентацииЭкрана();
	
КонецПроцедуры








&НаКлиенте
Процедура ПриОткрытии(Отказ)
	АсинхронныйСканерИнициализирован = ПодключаемоеОборудованиеВызовСервера.СканерШтрихкодовИнициализирован();

	Если ИспользуетсяАсинхронныйСканер И АсинхронныйСканерИнициализирован = Ложь Тогда
		ПодключитьОбработчикОжидания("Подключаемый_ПодключитьАссинхронныйСканерШтрихкодов", 0.1, Истина);
	КонецЕсли;

КонецПроцедуры



&НаКлиенте
Процедура СообщениеИнициализацииНажатие(Элемент)
	ОткрытьФорму("Обработка.Сервис.Форма.Инициализация", , ЭтаФорма,,,,, РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
КонецПроцедуры

&НаКлиенте
Процедура АктивироватьСканер(Команда)
	
	ИнициализироватьАсинхронныйСканер();
	
КонецПроцедуры

&НаКлиенте
Процедура ИнициализироватьАсинхронныйСканер()
	
	ПодключаемоеОборудованиеКлиент.ИнициализироватьАсинхронныйСканер(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриИзмененииПараметровЭкрана()
	ПриИзмененииПараметровЭкранаСервер();
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	
	Если ПодключаемоеОборудованиеКлиент.ЭтоОповещениеСканераШтрихкода(ИмяСобытия) И ВводДоступен() Тогда
		ДополнительныеПараметры = Новый Структура;
		ДополнительныеПараметры.Вставить("Форма", ЭтаФорма);
		ОбработатьПолученныйШтрихкод(Параметр, ДополнительныеПараметры);
	ИначеЕсли  ИмяСобытия = "KeyPress"  И ВводДоступен() Тогда
		Если ЭтаФорма.ТекущийЭлемент	= Элементы.Контрагент Тогда
		  	Если  НРег(Параметр) = "enter" Тогда
				ПолучитьКонтрагента(Неопределено);
			КонецЕсли;
			
		КонецЕсли;
	ИначеЕсли ИмяСобытия = "ИзмененоПодразделение" Тогда
		
		ОбновитьПодразделение();
		
	ИначеЕсли ИмяСобытия = "ИзмененыЗначенияНастроек" Тогда
		
		НастроитьФормуПоЗначениямНастроек();
	
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПодключитьАссинхронныйСканерШтрихкодов()
	
	ИнициализироватьАсинхронныйСканер();
	
КонецПроцедуры



#Область ПрограммныйИнтерфейс

&НаКлиенте
Процедура ОбработатьПолученныйШтрихкод(ПолученныйШтрихкод, Параметры) Экспорт
	Если ПустаяСтрока(ПолученныйШтрихкод) Тогда
		Возврат;
	КонецЕсли;
	ШтрихКод = ОбщегоНазначенияКлиент.ПолучитьШтрихкодИзСтроки(ПолученныйШтрихкод);
	ДанныеПоТовару = ИнтеграцияТК_Клиент.ПолучитьДанныеПоТоваруКлиент(ШтрихКод,,,"Остаток|ШтрихКод|Продажи|Коэффициент|ИспМРЦ",СкладUUID);
	ОбработатьПолученныеДанные(ДанныеПоТовару,Параметры,ШтрихКод);
	
КонецПроцедуры

&НаКлиенте
Процедура Сканер(Результат, ДополнительныеПараметры) Экспорт

КонецПроцедуры

&НаКлиенте
Процедура ОбработкаЗакрытияСканирования(ДополнительныеПараметры) Экспорт
	Возврат;
КонецПроцедуры

&НаКлиенте
Процедура НадписьНеУстановленСканерНажатие(Элемент)
	ОткрытьФорму("Обработка.НастройкиПриложения.Форма.ПодключаемоеОборудованиеСканерШтрихкодов",,ЭтаФорма,,,,, РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
КонецПроцедуры


#КонецОбласти



&НаКлиенте
Процедура Сканировать(Команда)
	ИдетПроцессСканирования = Истина;
	ОткрытьДиалогСканирования();

КонецПроцедуры

&НаКлиенте
Процедура ОткрытьДиалогСканирования()
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("Форма", ЭтаФорма);
	ДополнительныеПараметры.Вставить("ПотоковоеСканирование");
	ДополнительныеПараметры.Вставить("ЗаголовокСканирования", НСтр("ru = 'Считайте штрих-код'"));
	ДополнительныеПараметры.Вставить("ИмяОбработчикаЗакрытияСканирования", "ОбработкаЗакрытияСканирования");
	
	ПодключаемоеОборудованиеКлиент.ПолучитьТовар(ДополнительныеПараметры);
	
КонецПроцедуры

&НаКлиенте
Процедура Поиск(Команда)
ОткрытьДиалогПоиска();

КонецПроцедуры


	&НаКлиенте
Процедура ОткрытьДиалогПоиска()
	
	//ДополнительныеПараметры = Новый Структура;
	//ДополнительныеПараметры.Вставить("Форма", ЭтаФорма);

	//ДополнительныеПараметры.Вставить("ЗаголовокСканирования", НСтр("ru = 'Введите штрикод / Код товара'"));
	//ДополнительныеПараметры.Вставить("ИмяОбработчикаЗакрытияСканирования", "ОбработкаЗакрытияСканирования");
	//
	//ПодключаемоеОборудованиеКлиент.ПолучитьТовар(ДополнительныеПараметры);
	
	Подсказка = НСтр("ru = 'Артикул товара'");
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ЗаголовокФормы", Подсказка);
	ПараметрыФормы.Вставить("ФорматРедактирования", "ЧЦ=15; ЧДЦ=0");

	
	Оповещение = Новый ОписаниеОповещения("ОповещениеУстановитьКоличество", ЭтотОбъект,Новый Структура("Форма",ЭтаФорма));
	
	ОткрытьФорму("ОбщаяФорма.ВводЧисла", ПараметрыФормы, ЭтаФорма,,,,Оповещение);

	
	
КонецПроцедуры

&НаКлиенте
Процедура ОповещениеУстановитьКоличество(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено ИЛИ Результат = КодВозвратаДиалога.Отмена Тогда
		Возврат;
	КонецЕсли;
	ПодключаемоеОборудованиеКлиент.ОповещениеПоискаПоШтрихкодуПК(Результат,ДополнительныеПараметры);
	
КонецПроцедуры



&НаКлиенте
Процедура Подключаемый_ОчиститьНомерСтрокиДляПодсветки()
	
	НомерСтрокиДляПодсветки = Неопределено;
	
КонецПроцедуры

&НаКлиенте
Процедура ПодсветитьСтроку(ИдентификаторСтроки)
	
	СтрокаТоваров = Объект.Товары.НайтиПоИдентификатору(ИдентификаторСтроки);
	
	Если НЕ СтрокаТоваров = Неопределено Тогда
		НомерСтрокиДляПодсветки = СтрокаТоваров.НомерСтроки;
		Элементы.Товары.ТекущаяСтрока = ИдентификаторСтроки;
		
		
		Если НЕ ГоризонтальнаяОриентацияЭкрана Тогда
			
			Элементы.СтраницыПролистывания.ТекущаяСтраница = Элементы.СтраницаТовары;
			
		КонецЕсли;
		
		
		
		ИнтервалСек = 1;
		ПодключитьОбработчикОжидания("Подключаемый_ОчиститьНомерСтрокиДляПодсветки", ИнтервалСек,Истина);
	КонецЕсли;
	
КонецПроцедуры



&НаКлиенте
Процедура ОбработатьПолученныеДанные(ДанныеПоТовару, ДополнительныеПараметры,ПолученныйШтрихкод) Экспорт
	
	Если ДанныеПоТовару.Результат = ложь Тогда
		Сообщить(?(ЗначениеЗаполнено(ДанныеПоТовару.ОписаниеОшибки), ДанныеПоТовару.ОписаниеОшибки,"Данные по штрих коду не получены"));
		Возврат;
	КонецЕсли;
	СтруктураОтвета = ДанныеПоТовару.Ответ;
	
	
	Если Булево(СтруктураОтвета.ИспМРЦ) Тогда
		 ОткрытьДиалогВводаМРЦ(СтруктураОтвета);
	 Иначе
		 ОбработатьТоварВыбор(СтруктураОтвета)
	КонецЕсли;
	
Конецпроцедуры





&НаКлиенте
Процедура ОткрытьДиалогВводаМРЦ(СтруктураОтвета)
	
	
	Подсказка = НСтр("ru = '"+СтруктураОтвета.НаименованиеТовара+" МРЦ '");
	Подсказка = НСтр("ru = ' МРЦ '");
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ЗаголовокФормы", Подсказка);
	ПараметрыФормы.Вставить("ФорматРедактирования", "ЧЦ=15; ЧДЦ=2");

	
	Оповещение = Новый ОписаниеОповещения("ОповещениеВыбраноМРЦ", ЭтотОбъект,Новый Структура("Форма,СтруктураОтвета",ЭтаФорма,СтруктураОтвета));
	
	ОткрытьФорму("ОбщаяФорма.ВводЧисла", ПараметрыФормы, ЭтаФорма,,,,Оповещение);

	
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьТоварВыбор(СтруктураОтвета,МРЦ="")
	
	ИдентификаторСтроки = ОпределитьСтроку(СтруктураОтвета.Артикул,МРЦ);
	ЗаполнитьСтроку(ИдентификаторСтроки, СтруктураОтвета,МРЦ);
	Если ВводкКоличества Тогда
		Элементы.Товары.ТекущаяСтрока = ИдентификаторСтроки;
		ТоварыВыбор(Неопределено,,,);
	Иначе
		
		ПодсветитьСтроку(ИдентификаторСтроки);
	КонецЕсли;
	

КонецПроцедуры



&НаКлиенте
Процедура ОповещениеВыбраноМРЦ(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено ИЛИ Результат = КодВозвратаДиалога.Отмена Тогда
		Возврат;
	КонецЕсли;  
	
	РезОтвет = ИнтеграцияТК_ВызовСервера.ПолучитьОстатокТовара(ДополнительныеПараметры.СтруктураОтвета.Артикул,Результат,СкладUUID);
	
	Если РезОтвет.Результат Тогда
		ДополнительныеПараметры.СтруктураОтвета.Вставить("Остаток",РезОтвет.Ответ.Остаток);
		Если РезОтвет.Ответ.Свойство("Продажа") Тогда 
		ДополнительныеПараметры.СтруктураОтвета.Вставить("Продажа",РезОтвет.Ответ.Продажа);
		КонецЕсли;
	КонецЕсли;
	
	ОбработатьТоварВыбор( ДополнительныеПараметры.СтруктураОтвета,Результат);	
	
КонецПроцедуры



&НаСервере
Процедура ЗаполнитьСтроку(ИдентификаторСтроки, ДанныеНоменклатуры,МРЦ = "")
	
	Строка = Объект.Товары.НайтиПоИдентификатору(ИдентификаторСтроки);
	ЗаполнитьЗначенияСвойств(Строка,ДанныеНоменклатуры,,"Количество,НаименованиеТовара");
	
	Если Строка.ИспМРЦ Тогда
		Строка.НаименованиеТовара = ДанныеНоменклатуры.НаименованиеТовара + " МРЦ - "+МРЦ+ " " +Строка.ШтрихКод;
		Строка.МРЦ = МРЦ;
	Иначе
		Строка.НаименованиеТовара = ДанныеНоменклатуры.НаименованиеТовара + " " +Строка.ШтрихКод;
	КонецЕсли;

	Если ДанныеНоменклатуры.Свойство("Остаток") Тогда
		Строка.Остаток = ДанныеНоменклатуры.Остаток;
	КонецЕсли;
	
	
	//
	Если НЕ ВводкКоличества Тогда
	//	
	//	Строка.Количество = Строка.Количество + 1;
	//Иначе
		Строка.Количество = Строка.Количество + ДанныеНоменклатуры.Количество;
	КонецЕсли;
	
	
	ОбновитьЗаписьПоСтроке(Строка);
	
КонецПроцедуры

&НаСервере
Функция ОпределитьСтроку(Артикул,МРЦ)
	
	НайденныеСтроки = Объект.Товары.НайтиСтроки(Новый Структура("Артикул,МРЦ", Артикул,Строка(МРЦ)));
	
	Если НайденныеСтроки.Количество() = 0 Тогда
		СтрокаТЧ = Объект.Товары.Добавить();
	Иначе
		СтрокаТЧ = НайденныеСтроки[0];
		
	КонецЕсли;
	
	Возврат СтрокаТЧ.ПолучитьИдентификатор();
	
КонецФункции

&НаСервере
Процедура ОбновитьЗаписьПоСтроке(Знач Строка, ИдентификаторСтроки = Неопределено)
	
	Если НЕ ИдентификаторСтроки = Неопределено Тогда
		СтрокаТЧ = Объект.Товары.НайтиПоИдентификатору(ИдентификаторСтроки);
	Иначе
		СтрокаТЧ = Строка;
	КонецЕсли;
	Если ВидДокумента = "ZAK" ИЛИ ВидДокумента = "PRIX" Тогда
		ЗаписьПоСтроке = НСтр("ru = 'Принято %Количество% из %Остаток%%ЕдИзм% Х %Коф%'");
		ЗаписьПоСтроке = СтрЗаменить(ЗаписьПоСтроке, "%Остаток%", Формат(СтрокаТЧ.Остаток, ЗначениеНастроекПовтИсп.ФорматКоличественныхПолей()));
		
	Иначе
		ЗаписьПоСтроке = НСтр("ru = '%Количество% из %Остаток%%ЕдИзм% Х %Коф% оп. прод.- %Продажи%'");
	КонецЕсли;
	 	нМрц = ?(СтрокаТЧ.ИспМРЦ," МРЦ - "+СтрокаТЧ.МРЦ,""); 	
		ЗаписьПоСтроке = СтрЗаменить(ЗаписьПоСтроке, "%Количество%", Формат(СтрокаТЧ.Количество, ЗначениеНастроекПовтИсп.ФорматКоличественныхПолей()));
		ЗаписьПоСтроке = СтрЗаменить(ЗаписьПоСтроке, "%Остаток%", Формат(СтрокаТЧ.Остаток, ЗначениеНастроекПовтИсп.ФорматКоличественныхПолей()));
		ЗаписьПоСтроке = СтрЗаменить(ЗаписьПоСтроке, "%ЕдИзм%",      Строка(СтрокаТЧ.НаименованиеЕдиницы));
		ЗаписьПоСтроке = СтрЗаменить(ЗаписьПоСтроке, "%Коф%",      Строка(СтрокаТЧ.Коэффициент)+""+нМрц);
		
		ЗаписьПоСтроке = СтрЗаменить(ЗаписьПоСтроке, "%Продажи%",      Формат(СтрокаТЧ.Продажи, ЗначениеНастроекПовтИсп.ФорматКоличественныхПолей()));


	СтрокаТЧ.ТоварыЗаписьПоСтроке = ЗаписьПоСтроке;
	
КонецПроцедуры


&НаКлиенте
Процедура СкладСписанияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Если Не Инициализирован Тогда
		Сообщить("Устройство не инициализировано");
		Возврат;
	КонецЕсли;
	
	
	СтуктураОтвет =  ИнтеграцияТК_Клиент.ПолучитьСписокСкладов();
	
	Если СтуктураОтвет.Результат  Тогда
		
		Оповещение = Новый ОписаниеОповещения("ПослеВыбораЭлемента", ЭтаФорма);
		
		СтуктураОтвет.Ответ.ПоказатьВыборЭлемента(Оповещение,"Склад списания");
	Иначе
		Сообщить(СтуктураОтвет.ОписаниеОшибки);
	КонецЕсли;

	
КонецПроцедуры


&НаКлиенте
Процедура ОчиститьРеквизиты(ТипРеквизита)
	Если ТипРеквизита = "Контрагент"	Тогда
		Контрагент = "";
		КонтрагентUUID = "";
	КонецЕсли;
КонецПроцедуры
&НаКлиенте
Процедура ЗаполнитьРеквизиты(СтруктураОтвета,ТипРеквизита)
	Если ТипРеквизита = "Контрагент"	Тогда
		Контрагент = СтруктураОтвета.Name;
		КонтрагентUUID = СтруктураОтвета.UUID;
	КонецЕсли;

КонецПроцедуры


&НаКлиенте
Процедура ПослеВвода(Результат,ДополнительныеПараметры) Экспорт
	   
	Если Результат = Неопределено Тогда
		ОчиститьРеквизиты(ДополнительныеПараметры);	
	Иначе
	
		СтуктураОтвет =  ИнтеграцияТК_Клиент.ПолучитьКонтрагентаПоЕДРПО(Результат);
		Если СтуктураОтвет.Результат Тогда
			ЗаполнитьРеквизиты(СтуктураОтвет.Ответ,ДополнительныеПараметры);
		Иначе
			 ОчиститьРеквизиты(ДополнительныеПараметры);
		КонецЕсли;
		
		
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура ПослеВыбораЭлемента(Результат,ДополнительныеПараметры) Экспорт
	   
	Если Результат = Неопределено Тогда
		Склад ="";
		СкладUUID ="";
		Сообщить("Не выбран склад списания!");
	
	Иначе
		Склад      = Результат.Представление;
		СкладUUID  = Результат.Значение;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция ПолучитьПараметрыСтроки()
	//
	//Если ГоризонтальнаяОриентацияЭкрана Тогда
	//	ТекущиеДанные = Элементы.ТоварыГоризонт.ТекущиеДанные;
	//Иначе
		ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	//КонецЕсли;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	СтруктураПараметров = Новый Структура;
	
	СтруктураПараметров.Вставить("ИдентификаторСтроки", ТекущиеДанные.ПолучитьИдентификатор());
	СтруктураПараметров.Вставить("НомерСтроки",         ТекущиеДанные.НомерСтроки);
	СтруктураПараметров.Вставить("НаименованиеТовара",  ТекущиеДанные.НаименованиеТовара);
	Если ВидДокумента = "IN" Тогда
		СтруктураПараметров.Вставить("КоличествоДокумент",          ТекущиеДанные.Количество);
	Иначе	
		СтруктураПараметров.Вставить("Количество",          ТекущиеДанные.Количество);
	КонецЕсли;
	СтруктураПараметров.Вставить("НаименованиеЕдиницы", ТекущиеДанные.НаименованиеЕдиницы); 
	СтруктураПараметров.Вставить("НомерСтрокиДокумента",ТекущиеДанные.НомерСтрокиДокумента);

	СтруктураПараметров.Вставить("ДоументСервер",       ДоументСервер);
	СтруктураПараметров.Вставить("ВидДокумента",        ВидДокумента);
	СтруктураПараметров.Вставить("КоличествоОжидаемое",        ТекущиеДанные.Остаток);

		
	
	СтруктураПараметров.Вставить("ТолькоПросмотрФормы", Ложь);
	
	Возврат СтруктураПараметров;
КонецФункции


&НаКлиенте
Процедура ТоварыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	ПараметрыСтроки = ПолучитьПараметрыСтроки();
	
	Если НЕ ПараметрыСтроки = Неопределено Тогда
		
		ДополнительныеПараметры = Новый Структура;
		ДополнительныеПараметры.Вставить("ИдентификаторСтроки", ПараметрыСтроки.ИдентификаторСтроки);
		
		ОписаниеОповещения = Новый ОписаниеОповещения("ОповещениеИзменитьСтроку", ЭтотОбъект, ДополнительныеПараметры);
		
		ОткрытьФорму("ОбщаяФорма.РедактированиеСтроки", ПараметрыСтроки, ЭтаФорма,,,,ОписаниеОповещения);
		
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОповещениеИзменитьСтроку(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено ИЛИ Результат = КодВозвратаДиалога.Отмена Тогда
		Возврат;
	КонецЕсли;
	
	ИдентификаторСтроки = ДополнительныеПараметры.ИдентификаторСтроки;
	СтрокаТаблицы = Объект.Товары.НайтиПоИдентификатору(ИдентификаторСтроки);
	
	
	Если Результат.Свойство("УдалитьСтроку") Тогда
			
		ИндексСтроки = Объект.Товары.Индекс(СтрокаТаблицы);
		Объект.Товары.Удалить(ИндексСтроки);
		Объект.Товары.Сортировать("НомерСтрокиДокумента");

		Модифицированность = Истина;
		
	ИначеЕсли Результат.Свойство("Сохранить") Тогда
		
		ЗаполнитьЗначенияСвойств(СтрокаТаблицы, Результат);
		
		ОбновитьЗаписьПоСтроке(,ИдентификаторСтроки);
		
		Модифицированность = Истина;
		Объект.Товары.Сортировать("НомерСтрокиДокумента");
		ПодсветитьСтроку(ИдентификаторСтроки);
	КонецЕсли;
	
	
КонецПроцедуры




&НаКлиенте
Процедура ТоварыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;

КонецПроцедуры

&НаКлиенте
Процедура ТоварыПередНачаломИзменения(Элемент, Отказ)
	Отказ = Истина;
	ТоварыВыбор(Элемент,,,);
КонецПроцедуры

&НаКлиенте
Процедура СтраницыПролистыванияПриСменеСтраницы(Элемент, ТекущаяСтраница)
	ОтключитьОбработчикПодсветки();
КонецПроцедуры

&НаКлиенте
Процедура ОтключитьОбработчикПодсветки()
	ОтключитьОбработчикОжидания("Подключаемый_ОчиститьНомерСтрокиДляПодсветки");
КонецПроцедуры
	
&НаКлиенте
Процедура Отправить(Команда)
	
	
	Отказ = ПроверитьКорректность();
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	Рез = ПередатьНаСервер();
	
	Если Рез.Результат Тогда
		
		Сообщить("Документ выгружен успешно");
		
		Если ВидДокумента = "ZAK" И  Объект.Товары.Количество()> 0 Тогда
			ПоказатьВопрос(Новый ОписаниеОповещения("ПослеПродолжениеПриема",ЭтотОбъект),"В документе остался не принятый товар, продолжить прием?",РежимДиалогаВопрос.ДаНет);
		Иначе
			ВыполняетсяЗакрытие = Истина;
			Закрыть(Новый Структура("УдалитьСтроку"));
		КонецЕсли;
	Иначе
		Сообщить("Ошибка отправки документа!"+Символы.ПС+Рез.ОписаниеОшибки);
	КонецЕсли;
	
 
КонецПроцедуры

&НаКлиенте
Функция  ПроверитьКорректность()
	Если ПустаяСтрока(СкладUUID) Тогда
		Сообщить("Не выбран склад");
		Возврат Истина;
	КонецЕсли;
	
	Если ВидДокумента ="IN" И ПустаяСтрока(КонтрагентUUID) тогда
		Сообщить("Контрагент не выбран");
		Возврат Истина;
	ИначеЕсли ВидДокумента ="Списание" И НЕ ЗначениеЗаполнено(СтатьяСписания) Тогда
		Сообщить("Укажите статью списания");
		Возврат Истина;
	ИначеЕсли 	 ВидДокумента ="ZAK" ИЛИ   ВидДокумента = "ПриемТовара" Тогда
		Если НЕ ЗначениеЗаполнено(ДатаДокумента) Тогда
			Сообщить("Укажите дату накладной");
			Возврат Истина;
		КонецЕсли;
	ИначеЕсли  ВидДокумента ="VOZ" Тогда
		//Если ПустаяСтрока(КонтрагентUUID) Тогда
		//	Сообщить("Контрагента не выбран");
		//	Возврат Истина;
		//КонецЕсли;
		Если ПустаяСтрока(СкладUUID) Тогда
			Сообщить("Склад не выбран");
			Возврат Истина;
		КонецЕсли;
		
	КонецЕсли;
	
	
		
	Возврат Ложь;
	
КонецФункции




&НаСервере
Функция ПередатьНаСервер()
	
	СтруктураДокумента = Новый Структура();
	СтруктураДокумента.Вставить("UUID_Склад",СкладUUID);
	СтруктураДокумента.Вставить("ДоументСервер",ДоументСервер);
	
	Если ВидДокумента ="ZAK" Тогда
		СтруктураДокумента.Вставить("ДатаВхДокумента",Формат(ДатаДокумента,"ДФ=yyyyMMdd"));
		СтруктураДокумента.Вставить("НомерВхДокумента",НомерДокумента);
	ИначеЕсли ВидДокумента = "ПриемТовара"  Тогда
		СтруктураДокумента.Вставить("ID_Контрагента",Контрагенты.Код);
		СтруктураДокумента.Вставить("ДатаВхДокумента",Формат(ДатаДокумента,"ДФ=yyyyMMdd"));
		СтруктураДокумента.Вставить("НомерВхДокумента",НомерДокумента);
	ИначеЕсли ВидДокумента  = "IN" Тогда
		СтруктураДокумента.Вставить("UUID_Контрагента",КонтрагентUUID);
	ИначеЕсли ВидДокумента = "Списание" Тогда
		СтруктураДокумента.Вставить("Статья",СтатьяСписания.Код);
	ИначеЕсли ВидДокумента = "PRN" Тогда
		СтруктураДокумента.Вставить("ТипПеремещения",ТипПеремещения);
	ИначеЕсли ВидДокумента = "VOZ" Тогда
		СтруктураДокумента.Вставить("UUID_Контрагента",КонтрагентUUID);
	КонецЕсли;	
	
	
	Если ДоументСервер Тогда
		СтруктураДокумента.Вставить("ДокументUUID",ДокументUUID);
	КонецЕсли;
	
	МассивТоваров = Новый Массив;
	ПеремСтуктура = "Артикул,Коэффициент,Количество,НомерСтрокиДокумента"+?(ВидДокумента ="ZAK",",Остаток","")+?(ВидДокумента ="IN",",МРЦ","");
	
	Для Каждого СтрТовар Из Объект.Товары Цикл 
		Если СтрТовар.Количество = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		СтруктураСтрока = Новый Структура(ПеремСтуктура);
		ЗаполнитьЗначенияСвойств(СтруктураСтрока,СтрТовар,ПеремСтуктура);
		МассивТоваров.Добавить(СтруктураСтрока);
		
	КонецЦикла;
	СтруктураДокумента.Вставить("Товары",МассивТоваров);
	
	Рез = ИнтеграцияТК_ВызовСервера.ПередатьДокументНаСервер(СтруктураДокумента,ВидДокумента);
	
	Если ВидДокумента = "ZAK" Тогда
		
		МассивСтрокДляУдаления = Новый Массив;
		Для Каждого СтрТовар Из Объект.Товары Цикл 
			нКоличество = 	СтрТовар.Остаток -  СтрТовар.Количество;
			Если нКоличество > 0 Тогда
				СтрТовар.Количество = 0;
				СтрТовар.Остаток = нКоличество;
				ОбновитьЗаписьПоСтроке(СтрТовар);
			Иначе
				МассивСтрокДляУдаления.Добавить(СтрТовар);
			КонецЕсли;
			
		КонецЦикла;
		
		Для Каждого стрУдаления  Из МассивСтрокДляУдаления Цикл 
			Объект.Товары.Удалить(стрУдаления);
		КонецЦикла;
		
		
	КонецЕсли;
	

	
	Возврат Рез;
	
КонецФункции

&НаКлиенте
Процедура Расхождения(Команда)
	УстановитьРасхождения();
КонецПроцедуры
&НаСервере
Процедура УстановитьРасхождения()
	
	ПометкаВидимость = НЕ Элементы.ФормаРасхождения.Пометка;
	Элементы.ФормаРасхождения.Пометка = ПометкаВидимость;
	
	Если ПометкаВидимость Тогда
		Заголовок = "Все строки"
	Иначе
		Заголовок = "Только расхождения"
	КонецЕсли;
	
	уоВидимость = ЭтаФорма.УсловноеОформление.Элементы.Получить(0);
	уоВидимость.Использование = ПометкаВидимость;
	Элементы.ФормаРасхождения.Заголовок = Заголовок;
	
КонецПроцедуры


&НаКлиенте
Процедура ПолучитьКонтрагента(Команда)
	
	Если Не Инициализирован Тогда
		Сообщить("Устройство не инициализировано");
		Возврат;
	КонецЕсли;

	Если ПустаяСтрока(Контрагент) Тогда
	    	ОчиститьРеквизиты("Контрагент");
		Иначе
			СтуктураОтвет =  ИнтеграцияТК_Клиент.ПолучитьКонтрагентаПоЕДРПО(Контрагент);
		Если СтуктураОтвет.Результат Тогда
			ЗаполнитьРеквизиты(СтуктураОтвет.Ответ,"Контрагент");
		Иначе
			 ОчиститьРеквизиты("Контрагент");
		 КонецЕсли;
	 КонецЕсли;

	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Если НЕ ВыполняетсяЗакрытие Тогда
		Отказ = Истина;
		
		ПоказатьВопрос(Новый ОписаниеОповещения("ПередЗакрытиемЗавершение",ЭтотОбъект),"Закрыть документ?",РежимДиалогаВопрос.ДаНет);
	КонецЕсли;
	
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытиемЗавершение(РезультатВопроса,ДопоплнительныеПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		ВыполняетсяЗакрытие = Истина;
		Закрыть();
	КонецЕсли;
	
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеПродолжениеПриема(РезультатВопроса,ДопоплнительныеПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Нет Тогда
		ВыполняетсяЗакрытие = Истина;
		Закрыть(Новый Структура("УдалитьСтроку"));
	КонецЕсли;
	
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыПередУдалением(Элемент, Отказ)
	
	а=1;
	
КонецПроцедуры


ВыполняетсяЗакрытие = Ложь;
